[
  {
    "image": "https://i.ibb.co.com/LXtkR4Cm/1.webp",
    "title": "PhotoMaster Pro",
    "companyName": "PixelWorks Inc.",
    "id": 1,
    "description": "PhotoMaster Pro is a full-featured photo editing application designed for both casual users and professionals. With advanced filters, layers, and blending modes, users can achieve impressive results on the go. The app supports RAW image processing and includes intuitive tools for cropping, color correction, retouching, and masking. In addition, PhotoMaster Pro has built-in tutorials, social sharing, and integration with cloud storage, making it easy to manage and share your best work. Regular updates add new effects and improve performance, and the support team helps resolve issues quickly.",
    "size": 124,
    "reviews": 3.4,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 1521 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/5SLG2s107uPPgbkjFsKxdEMI8P85FDxZzZ2lXsryBxP3DhcH49ILOtW7verzgV6Xoavz",
    "title": "FitTrack Daily",
    "companyName": "HealthSync Ltd.",
    "id": 2,
    "description": "FitTrack Daily is a health and fitness tracking application that encourages users to meet their daily goals. It includes step counting, nutrition tracking, hydration reminders, sleep analytics, and workout logging features. Users can join challenges, track progress over time, and export data for more advanced analysis. The app also integrates with wearable devices and external sensors to aggregate your health metrics. Community features allow you to form groups, share achievements, and motivate friends on their fitness journey.",
    "size": 88,
    "reviews": 2.2,
    "ratingAvg": 4.2,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 740 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/GPFn__5drA7MpEu2YujuOGj3cUmHkRV9jlQ-MCh2dluli0LhGeTggHu9bad_F6hMcg",
    "title": "BudgetBuddy",
    "companyName": "FinSmart Solutions",
    "id": 3,
    "description": "BudgetBuddy helps users manage their personal finances in a simple and intuitive way. It allows you to categorize expenses, set spending limits, receive alerts, and visualize cash flow with charts. The app supports multiple accounts, recurring transactions, and budget forecasts. You can also export data as CSV or integrate with your bank (read-only) for automatic import of transactions. The goal is to empower users to save more, cut unnecessary expenses, and better understand their financial habits over time. Regular insights and spending tips help users improve their money decisions.",
    "size": 55,
    "reviews": 1.3,
    "ratingAvg": 4.6,
    "downloads": 4.2,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 515 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/rJaXm_Owjbz7T52kyrjjeAxLlnCgfQONhKi15Z8ksDz5ZCN24WmzhFfWZcPoSiFs4CCHpEWJ2WBpVI4UTjgYTQ",
    "title": "LangLearner",
    "companyName": "EduVerse",
    "id": 4,
    "description": "LangLearner is a language learning platform focused on immersive, bite-sized lessons and interactive exercises. Users can explore vocabulary, grammar, pronunciation, and conversational practice in over 25 languages. The app uses spaced repetition algorithms, speech recognition, and gamified progress tracking to make learning fun and effective. You can follow thematic challenges, practice speaking with native speakers, and track your long-term progress. LangLearner also supports offline mode so that users can continue learning on the go without needing constant internet connectivity.",
    "size": 95,
    "reviews": 3.0,
    "ratingAvg": 4.4,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1350 },
      { "name": "5 star", "count": 1035 }
    ]
  },
  {
    "image": "https://cdn.dribbble.com/userupload/22344343/file/original-10cfad201aa36d18a81aa6b3d7df7bc5.gif",
    "title": "TravelMate",
    "companyName": "WanderTech",
    "id": 5,
    "description": "TravelMate is an app that helps you plan, organize, and enjoy your travels seamlessly. You can create itineraries, track flights and trains, get suggestions for local attractions, and receive real-time updates on delays or changes. Offline maps, currency converters, language phrasebooks, and weather forecasts are built in for convenience. TravelMate also has a social feature, letting you find other travelers nearby, share trip plans, or join group excursions. Whether for weekend getaways or long adventures, this app is your travel companion wherever you go.",
    "size": 150,
    "reviews": 4.1,
    "ratingAvg": 4.3,
    "downloads": 8.5,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 1420 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ziyzMXQ2xpBlaA-q1yRG8_643zRsyDdLfnewISiZQ2WIIYc6jXBWLUnu01Bvfbqar9A=w240-h480-rw",
    "title": "MindfulMe",
    "companyName": "ZenLab Studios",
    "id": 6,
    "description": "MindfulMe is a meditation and mindfulness app designed to help users reduce stress, improve sleep, and cultivate focus. It offers guided meditations, breathing exercises, ambient soundscapes, and daily reflections. You can set custom meditation durations, track your streaks, and log your mood before and after sessions. The app also includes background sounds like rain, forest, or white noise to help you relax. Daily challenges and reminders encourage consistent practice and deepen mindfulness over time.",
    "size": 65,
    "reviews": 2.0,
    "ratingAvg": 4.7,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 650 },
      { "name": "5 star", "count": 1057 }
    ]
  },
  {
    "image": "https://apps.gnome.org/icons/twitter/io.gitlab.news_flash.NewsFlash.png",
    "title": "NewsFlash",
    "companyName": "ByteStream Media",
    "id": 7,
    "description": "NewsFlash delivers breaking news, curated stories, and personalized topics all in one app. Users can customize their feed by selecting interests, mute sources, and follow specific journalists. The app supports offline reading, dark mode, and push notifications for urgent headlines. Multimedia content such as videos, podcasts, and infographics enrich the reading experience. NewsFlash also includes comments and community sections so you can engage with other readers and discuss trending events.",
    "size": 80,
    "reviews": 2.9,
    "ratingAvg": 4.1,
    "downloads": 9.1,
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1150 },
      { "name": "5 star", "count": 750 }
    ]
  },
  {
    "image": "https://assets.nintendo.com/image/upload/c_fill,w_1200/q_auto:best/f_auto/dpr_2.0/ncom/software/switch/70010000072154/63fbed90a0d82ddf20a595baaf75c3502a9110eac690a01f62c913905bd9e290",
    "title": "GameZone Arcade",
    "companyName": "FunPlay Co.",
    "id": 8,
    "description": "GameZone Arcade is a curated hub of casual games where users can enjoy a variety of genres: puzzles, platformers, arcade, and mini-adventures. New daily challenges, leaderboards, and achievement systems keep players engaged. The app also supports multiplayer modes so friends can compete or cooperate. The in-app store offers optional premium content, but most games are free to play. GameZone Arcade syncs progress across devices and includes parental controls for families.",
    "size": 120,
    "reviews": 5.6,
    "ratingAvg": 4.0,
    "downloads": 1.2,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/mzVsGujgYaiae3KrAMeNHAokL868izGdPxJ0QDgeaECgxBhyizaLmBTbD5Bxynm-L0w",
    "title": "StudyBuddy",
    "companyName": "LearnWave",
    "id": 9,
    "description": "StudyBuddy is the ultimate study companion app for students of all levels. The app offers flashcards, spaced repetition quizzes, study scheduling, and collaborative study rooms. You can join study groups, share notes, and get peer feedback. The integrated statistics dashboard shows which topics you need to focus on more, and adaptive quizzes help reinforce weak areas. With offline support and synchronization across devices, StudyBuddy helps you stay on top of your learning wherever you are.",
    "size": 60,
    "reviews": 2.3,
    "ratingAvg": 4.8,
    "downloads": 4.7,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1400 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS1y5TWe_Wqsc75w0ZQY6wHdBKdgl8U8E30ZA&s",
    "title": "CookBook Pro",
    "companyName": "Culinary Tech",
    "id": 10,
    "description": "CookBook Pro is a cooking and recipe app featuring thousands of recipes from around the world. You can browse by diet, cuisine, ingredient, or difficulty level. Each recipe includes step-by-step instructions, photos, and timers. The app also lets you generate shopping lists, plan weekly menus, and scale ingredient quantities automatically. With video tutorials, nutritional breakdowns, and voice control support, CookBook Pro helps both novice and experienced cooks create meals confidently.",
    "size": 140,
    "reviews": 3.1,
    "ratingAvg": 4.3,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 1410 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/5Gv9yVhvbcwYG8WAapAIpcH44gGsr5bUsPqT5LTXmaEtFUK2guBfJ7pAhGXXMBMLEA=w526-h296-rw",
    "title": "SleepWell",
    "companyName": "DreamWorks Labs",
    "id": 11,
    "description": "SleepWell helps users improve sleep quality by offering features such as sleep tracking, white noise, bedtime reminders, and guided sleep meditations. The app monitors sleep cycles and provides suggestions to optimize rest routines. You can log dreams, set wake-up windows, and view detailed sleep analytics in charts. With personalized sleep coaching and nightly challenges, SleepWell supports holistic rest and recovery. It also adapts to day changes, travel, and shift schedules for consistent sleep harmony.",
    "size": 70,
    "reviews": 1.78,
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 55 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 930 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/3CYcaLeYCzQGI5wQ2lXKFF3WoljL2mlTm0wPhJwL-asTsDeaVofiQmBs_WPT_mXEew",
    "title": "TaskMaster",
    "companyName": "FlowApps",
    "id": 12,
    "description": "TaskMaster is a productivity and task management app aimed at helping users organize their life and work. You can create projects, subtasks, set deadlines, attach files, add reminders, and assign priorities. The app supports collaboration, shared tasks, and comments for teams or families. Gantt chart views, calendar integrations, and widgets make it accessible from anywhere. TaskMaster also tracks productivity insights and suggests focus sessions or break reminders to keep you on track and avoid burnout.",
    "size": 110,
    "reviews": 2.55,
    "ratingAvg": 4.4,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1040 }
    ]
  },
  {
    "id": 13,
    "title": "Snapify",
    "companyName": "PixelCraft Labs",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQn7kYIEUKjb7fJrKs-G71EF-1X9pXWlhV6uA&s",
    "description": "Snapify is a next-generation photo editing app designed for creators who love transforming their images into professional works of art. It includes hundreds of filters, AI retouching tools, and advanced background removal capabilities. Users can enhance portraits, create collages, or apply cinematic effects in just a few taps. The intuitive interface ensures that both beginners and professionals can use it effortlessly. Snapify also offers cloud sync, so your creations are accessible across devices instantly.",
    "size": 94,
    "reviews": 76,
    "ratingAvg": 4.6,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 340 },
      { "name": "2 star", "count": 520 },
      { "name": "3 star", "count": 1020 },
      { "name": "4 star", "count": 3340 },
      { "name": "5 star", "count": 8520 }
    ]
  },
  {
    "id": 14,
    "title": "NoteFlow",
    "companyName": "MindWorks Inc.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQo0bmYEG0HP6-5C3yeHsg2afgTuP3hP_rm7g&s",
    "description": "NoteFlow makes capturing ideas simple, beautiful, and efficient. Whether you’re in a meeting, class, or on the go, NoteFlow helps you organize thoughts instantly. It supports handwriting, audio notes, and automatic cloud backup. Integrated AI summaries allow you to convert long notes into quick, concise points. Sync across devices ensures you never lose a single idea. NoteFlow also supports dark mode and offline access for maximum convenience, making it perfect for students and professionals alike.",
    "size": 62,
    "reviews": 49,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 410 },
      { "name": "3 star", "count": 960 },
      { "name": "4 star", "count": 3120 },
      { "name": "5 star", "count": 7200 }
    ]
  },
  {
    "id": 15,
    "title": "TaskTrack Pro",
    "companyName": "NovaByte Systems",
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple126/v4/d4/6d/6e/d46d6e1a-f2ae-1f9a-e9e8-304c37452e1e/AppIcon-0-0-1x_U007emarketing-0-7-0-0-85-220.png/1200x630wa.png",
    "description": "TaskTrack Pro is an intelligent task management tool that helps users stay productive and organized. From managing personal goals to handling team projects, it offers advanced scheduling, reminders, and AI suggestions for prioritization. The app integrates seamlessly with Google Calendar, Slack, and Notion. With real-time sync and progress visualization, it gives users complete control over their productivity journey. The clean interface and customizable workflow make it suitable for freelancers and enterprise teams alike.",
    "size": 88,
    "reviews": 64,
    "ratingAvg": 4.7,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 980 },
      { "name": "4 star", "count": 2780 },
      { "name": "5 star", "count": 9020 }
    ]
  },
  {
    "id": 16,
    "title": "FitPulse",
     "image": "https://i.ibb.co.com/Q7sJYswZ/fit2.webp",
    "companyName": "EduVerse",
    "description": "FitPulse brings the gym experience to your pocket. It offers personalized workout plans, calorie tracking, and AI-based coaching to help you reach fitness goals efficiently. The app syncs with smartwatches and sensors for real-time feedback. Whether you’re a beginner or professional athlete, FitPulse provides adaptable programs for all fitness levels. Daily motivation, social challenges, and progress analytics make staying consistent easier than ever before.",
    "size": 105,
    "reviews": 58,
    "ratingAvg": 4.5,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2980 },
      { "name": "5 star", "count": 7800 }
    ]
  },
  {
    "id": 17,
    "title": "TravelEase",
    "companyName": "WanderTech Studios",
    "image": "https://avatars.githubusercontent.com/u/173172137?s=280&v=4",
    "description": "TravelEase is your smart travel companion. Plan trips, explore local experiences, and get AI-curated itineraries that fit your interests and budget. The app integrates flight tracking, hotel bookings, and real-time translation features. With an offline map and digital travel journal, it ensures you enjoy every journey hassle-free. TravelEase also offers a community space to share memories and discover hidden gems recommended by other travelers worldwide.",
    "size": 79,
    "reviews": 82,
    "ratingAvg": 4.8,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 310 },
      { "name": "3 star", "count": 870 },
      { "name": "4 star", "count": 2940 },
      { "name": "5 star", "count": 10300 }
    ]
  },
  {
    "id": 18,
    "title": "Musicora",
    "companyName": "Harmonic Wave Ltd.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_S1pCsoQ_8na9zZdFm8vOG9Z1QOmusru1LA&s",
    "description": "Musicora is a next-gen music streaming platform offering a massive library of global and indie artists. It provides personalized playlists, mood-based recommendations, and high-fidelity audio streaming. With offline playback, lyric sync, and real-time sharing options, Musicora makes listening social and immersive. The app also supports cross-device sync so your playlists travel with you everywhere. Its sleek design and minimal buffering make it a joy for every music lover.",
    "size": 112,
    "reviews": 97,
    "ratingAvg": 4.9,
    "downloads": 13,
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 430 },
      { "name": "3 star", "count": 1120 },
      { "name": "4 star", "count": 2760 },
      { "name": "5 star", "count": 9800 }
    ]
  },
  {
    "id": 19,
    "title": "EduMate",
    "companyName": "LearnX Solutions",
    "image": "https://i.ibb.co.com/rfFJtHB6/edumate.jpg",
    "description": "EduMate is a smart e-learning app designed to make studying more engaging. It offers video lectures, flashcards, quizzes, and progress tracking for learners of all ages. The AI-driven learning assistant adapts to your pace and helps you master subjects effectively. EduMate also provides collaboration tools for teachers and students, making online classrooms interactive and efficient. Its clean interface and multi-language support make education accessible for everyone.",
    "size": 95,
    "reviews": 72,
    "ratingAvg": 4.6,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 270 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 9000 }
    ]
  },
  {
    "id": 20,
    "title": "Cookly",
    "companyName": "KitchenVerse Labs",
    "image": "https://images.unsplash.com/photo-1504674900247-0877df9cc836",
    "description": "Cookly helps home chefs discover and share recipes from around the world. The app includes step-by-step instructions, ingredient substitution tips, and meal planning tools. Users can upload their own recipes, rate others, and follow favorite chefs. With built-in timers, grocery lists, and nutritional insights, cooking becomes simpler and more enjoyable. Cookly’s beautiful food photography and smart search features make it the perfect app for anyone who loves to cook or explore new cuisines.",
    "size": 78,
    "reviews": 67,
    "ratingAvg": 4.7,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 290 },
      { "name": "2 star", "count": 470 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 8500 }
    ]
  }
]
